"---------------list---------------------------------------------------------------------------------------------------"
'''# Робота із списками
# Структура впорядкованого набору даних [певна послідовність]
lis = [input("Заповніть список: ")]
liss = [1,2,6,4]
print(lis,liss)'''
"---------list------append---extend---insert---remove---count---pop----sort----reverse------clear---1"
'''l1=[1]
l2=[3,4,5]
l3=["M","i","k","e","S","h","e","v","c","h","e","n","k","o"]
l1.append(2)             #додає елемент в кінець списку
l1.extend(l2)            #додає
l1.insert(1,"Mike")      #замінює
l2.remove(5)             #видаляє
print(l3.count("M"))
print(l2.pop(0))         #видаляє вказаний елемент
print(l1)
l3.sort()                #сортує за параметром
print(l3)
l3.reverse()             #перевертає список
print(l3)
l3.clear()               #очищує
print(l3)

"---------------list---------------------------2"
# приклад пошуку у списку і переліку за типом
l4 = [input("Заповніть список: ")]
n = input("Виберіть шуканий знак: ")
print("Знайдено знаків",n,": ",l4.count(n))
"---------------list---------------------------3"
# вибірка за індексом
l5 = [1,2,3,4,5,6,7,8,9,0]
print(l5[0],l5[-1])       # тут l5[-1] відображає останій (-1) елемент'''
"---------------list---------------------------4"
'''# приклад використання списків
l = [1,2,3,4,5,6,7,8,9,0]
print("Список: ",l)
i = int(input("Введіть і (число яке пропускає попередні і власне значення): "))
if not l.count(i)==0:    # або if l.count(i)!=0:
    while i < 9:
        print(l[i], end=" ")
        i += 1
else:
 print("Дане число не входть в список")'''

"---------------item--(l[:2])------------------------"
'''#Видалення по ідексах, зрізи
l=[1,4,7]
print(l[:2])     # видаляє третій елемент (у Python нумерація починається з нуля, а не з одиниці)
"---------------Кортеж-(менша вага, ніж у списках)- без наступних змін даних-----------------------"
A=(1,2,3,4,5,6,7,8,9)   # Кортеж не можливо потім змінити
B=[1,2,3,4,5,6,7,8,9]
C=tuple(input("Введіть речення, яке плануєте розбити на знаки/літери: "))    # tuple() - розбиття на складові
print('Кортеж - ',A.__sizeof__(),' bytes') # розмір у байтах
print('Список - ',B.__sizeof__(),' bytes')
print(C)'''
"----------------------tuple---------------------------"
'''running = True
while running:
    l= tuple(input("Заповніть список: "))
    n=input("Виберіть шуканий знак: ")
    print("Знайдено знаків",n,": ",l.count(n))

    if n == '!' or l.count('!')>=1:
        running = False
else:
    print('End of the cycle...')'''





