import pandas as pd

"""Series --- одномірна таблиця з одним пронумерованим стовпцем"""
sr_0 = pd.Series(data=None, index=None, dtype='object', name=None, copy=None, fastpath=None)
# data - масив, скаляр або dict  ---  структура таблиці
# index - одновим. масив, список міток для доступу до е-тів Series (довжина сп = довжина data)
# dtype  - тип даних
# copy - при True створюєится копія масиву даних

sr_1 = pd.Series([1, 2, 3, 4, 5], ['a', 'b', 'c', 'd', 'e'])  # простий масив даних
# print(sr_1)

# -----------------
import numpy as np

arr = np.array([1, 2, 3, 4, 5])
sr_2 = pd.Series(arr, ['a', 'b', 'c', 'd', 'e'])  # використання векторів з numpy
# print(sr_2)

# -----------------
dc = {'a': 1, 'b': 2, 'c': 3}  # класичне використання словників
sr_3 = pd.Series(dc)
# print(sr_3)

# -----------------
a = 13
sr_4 = pd.Series(a, ['a', 'b', 'c'])  # використання констант для узагальнення даних
# print(sr_4)

"""Робота з Series:"""
s0 = sr_4[0]  # вибір елемента таблиці за значенням
s1 = sr_4['a']  # вибір елемента таблиці за ключем
s2 = sr_4[:2] + sr_4['a':'d']  # зріз
s3 = sr_4[sr_4 <= 13]  # умовний зріз
s4 = s3 + s2 * s1  # дії, як над векторами
