n = 1
sn = 'Shevchenko'

m = ' mike '.title()
print(m.rstrip().lstrip())  # видалення відступів

print(sn[::-1])  # перевертання строки -- зріз

print(
    sn.count('o', 0,
             10))  # знаходження кількості входженнь набору символів у стрічку із певними параметрами пошуку
# (тут [0,10))

print(sn.find('o', 0, 10))  # знаходження порядку входжень набору символів у стрічку із певними параметрами пошуку,
# при False повертає "-1"

print(sn.index('o', 0, 10))  # знаходження порядку входжень набору символів у стрічку із певними параметрами пошуку,
# при False повертає "Error"

print(sn.rfind('o', 0, 10))  # те саме, тільки пошук відбувається "з права на ліво"

print(sn.replace("o", "a",
                 n))  # заміна усіх (або n) знаків одного роду на інші (тут рід алфавітний), видалення при ("a", " ")

print(sn.isalnum())  # True, якщо усі символи буквенні
print(sn.isdigit())  # True, якщо усі символи цифрові, знаки "." та " " видають False - корисно для Is INT

print(sn.rjust(12, "-"))  # доповнення вибраними символами строки зправа

print("Mike Sh".split(" "))  # Розбиття строки на елементи списку за допомогою певного символа
print(''.join(tuple(sn)))  # Складання строки із множини символів

q = ['1', '2', '3', '4']
print('-'.join(q))

print(sn.strip())  # видаляє пробіли та знаки переносу; існує "rstip" "lstrip"
