# Метод self
print("\n# ------------self-------------------")


class Point:
    x, y = 10, 15

    def set_cords(self):
        """self - обовязковий метод усередині ккласу;
        створює локальні змінні для створеного екземпляра класу
        """
        print(self.__dict__, '-- спосіб 1')

    def set_cords_self(self, x, y):
        self.x = x
        self.y = y
        print(self.__dict__, '-- спосіб 2')


# створюємо локальні зміні для екземпляру "pt" і виводим їх у вигляді словника -- спосіб 1
pt = Point()

pt.x, pt.y = 1, 2
pt.set_cords()

# передаєм x, y у ф-цію із вводу нижче: -- спосіб 2
pt.set_cords_self(2, 4)  # або Point.set_cords_self(pt, 5, 5)

print("\n# ------------__init__-------------------")


# Конструктор __init__, деструктор __dell__
class Point:
    def __init__(self, x=0, y=0):
        """Автоматично викликається при створенні екземпляру класу Point,
        а також передає локальні змінні екземпляру"""
        print("створення екзепляру класу Point")
        self.x = x
        self.y = y
        print(self.__dict__)

    def __del__(self):
        """Видалення певного екземпляру, якщо у нього відсутні зовнішні послання-- деструктор"""
        print(f'Видалення екземпляру {self.__str__()}')


pt = Point()  # вміст дужок не є необхідним, по початкові дані означені у __init__()
pt_ = Point(5, 4)




